Revit 2027 API
TableSectionData.GetCellParamId(Int32) Method
 Returns a column's ParamId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetCellParamId(
	int nCol
)
Public Function GetCellParamId (
	nCol As Integer
) As ElementId
public:
ElementId^ GetCellParamId(
	int nCol
)
member GetCellParamId :
        nCol : int -> ElementId
Parameters
nCol Int32
Return Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellParamId Overload
Autodesk.Revit.DB Namespace